Roh00t/SDTH-Killswitch-Demo/firmware/esp32_actuator/wifi_secrets.example.h
/*
 * Killswitch — ESP32-S3 Actuator Firmware
 *
 * Drives a 2-axis SG90 gimbal and a proxy effector (LED) from newline-
 * terminated ASCII commands on the UART bridge.
 *
 * THIS FIRMWARE IS THE SAFETY AUTHORITY. The host proposes; this decides.
 * It independently enforces the deadman timeout, the burn ceiling, arming,
 * and actuator bounds. It never trusts the host to do any of those.
 *
 * The effector on the bench is a KY-008 650 nm laser module — a low-power
 * stand-in, but a real emitter, not an indicator LED. Every guardrail here is
 * sized for a hazardous effector on purpose: the architecture claims this brain
 * re-hosts onto a real one, and that claim is only credible if the safety
 * logic was built for it from the start.
 *
 * NO FIRMWARE CHANGE was needed when the effector moved from an LED to the
 * laser module. The gate is a plain digitalWrite on the same pin either way;
 * only what hangs off it changed. Recorded here so the next reader does not go
 * looking for a driver that does not exist.
 *
 * Board:   ESP32-S3-N16R8 (16 MB flash, 8 MB PSRAM)
 * Library: ESP32Servo (Kevin Harrington)
 * Port:    UART bridge (CH343 on this board; CP2102/CH340 on others) — NOT
 *          native USB-CDC. The bridge stays enumerated across ESP32 resets;
 *          native USB re-enumerates and the host's serial handle dies.
 *
 * CAMERA: the OV5640 on this board's camera connector streams MJPEG over Wi-Fi
 * (KS_CAMERA below). The connector uses the ESP32-S3-EYE layout, which puts
 * SIOC on GPIO 5, VSYNC on 6 and HREF on 7. The actuator used to sit on those
 * three pins, and HREF on the laser gate would pulse the effector at line rate,
 * so the actuator moved and a compile-time check refuses any overlap. Camera,
 * Wi-Fi and the stream server run on core 0; the safety loop runs on core 1
 * and shares nothing with them. See CLAUDE.md.
 *
 * Wiring:
 *   GPIO 14 -> Pan servo signal     (5V + GND from a SEPARATE supply)
 *   GPIO 21 -> Tilt servo signal    (common ground with the ESP32)
 *   GPIO 1  -> Effector gate        (1k -> 2N2222 base; collector sinks the
 *                                    KY-008 '-' terminal; 10k pulldown to GND)
 *
 * The 10k pulldown on GPIO 1 is mandatory. Between power-on and the first line
 * of setup(), every ESP32 GPIO is a floating input. A floating gate is an
 * undefined effector state during boot, reflash, brownout and crash. Software
 * cannot fix this; the resistor can.
 */

#include <ESP32Servo.h>

// ---------------------------------------------------------------- pins ----
// Off GPIO 4-18: the camera connector owns those (see the header).
static constexpr int PIN_SERVO_PAN  = 14;
static constexpr int PIN_SERVO_TILT = 21;
static constexpr int PIN_EFFECTOR   = 1;

// 1 = stream the OV5640 over Wi-Fi. 0 = actuator only, as before.
#ifndef KS_CAMERA
#define KS_CAMERA 1
#endif

#if KS_CAMERA
#include <atomic>
#include "esp_camera.h"
#include "esp_http_server.h"
#include <ESPmDNS.h>
#include <WiFi.h>
#if __has_include("wifi_secrets.h")
#include "wifi_secrets.h"   // WIFI_SSID, WIFI_PASSWORD. Gitignored.
#else
#error "Copy wifi_secrets.example.h to wifi_secrets.h in this folder and put your hotspot name and password in it."
#endif

// ESP32-S3-EYE camera connector (Freenove ESP32-S3-WROOM CAM and its clones).
// From Espressif's CameraWebServer camera_pins.h, CAMERA_MODEL_ESP32S3_EYE.
static constexpr int CAM_PIN_XCLK  = 15;
static constexpr int CAM_PIN_SIOD  = 4;
static constexpr int CAM_PIN_SIOC  = 5;
static constexpr int CAM_PIN_D0    = 11;
static constexpr int CAM_PIN_D1    = 9;
static constexpr int CAM_PIN_D2    = 8;
static constexpr int CAM_PIN_D3    = 10;
static constexpr int CAM_PIN_D4    = 12;
static constexpr int CAM_PIN_D5    = 18;
static constexpr int CAM_PIN_D6    = 17;
static constexpr int CAM_PIN_D7    = 16;
static constexpr int CAM_PIN_VSYNC = 6;
static constexpr int CAM_PIN_HREF  = 7;
static constexpr int CAM_PIN_PCLK  = 13;

static constexpr int CAM_PINS[] = {
  CAM_PIN_XCLK, CAM_PIN_SIOD, CAM_PIN_SIOC, CAM_PIN_D0, CAM_PIN_D1, CAM_PIN_D2,
  CAM_PIN_D3, CAM_PIN_D4, CAM_PIN_D5, CAM_PIN_D6, CAM_PIN_D7, CAM_PIN_VSYNC,
  CAM_PIN_HREF, CAM_PIN_PCLK,
};
static constexpr bool usesCameraPin(int pin, size_t i = 0) {
  return i < sizeof(CAM_PINS) / sizeof(CAM_PINS[0]) &&
         (CAM_PINS[i] == pin || usesCameraPin(pin, i + 1));
}
// A camera signal on an actuator pin drives it from the sensor, outside every
// interlock in this file. Refuse to build rather than find out on the bench.
static_assert(!usesCameraPin(PIN_EFFECTOR),   "effector gate shares a camera pin");
static_assert(!usesCameraPin(PIN_SERVO_PAN),  "pan servo shares a camera pin");
static_assert(!usesCameraPin(PIN_SERVO_TILT), "tilt servo shares a camera pin");

static const char* CAM_HOSTNAME = "killswitch-cam";   // http://killswitch-cam.local/stream
#endif

// ------------------------------------------------------------ constants ----
static const unsigned long BAUD               = 921600UL;

// Actuator bounds. Also enforced host-side; twice is deliberate.
static const float PAN_MIN   = 0.0f;
static const float PAN_MAX   = 180.0f;
static const float TILT_MIN  = 45.0f;
static const float TILT_MAX  = 135.0f;
static const float STOW_PAN  = 90.0f;
static const float STOW_TILT = 90.0f;

// SG90 pulse widths. Calibrate per servo if travel is short or it buzzes at rest.
static const int SERVO_MIN_US = 500;
static const int SERVO_MAX_US = 2400;

// Effector cut if no valid command arrives inside this window.
static const unsigned long DEADMAN_TIMEOUT_MS = 250UL;
// Hard ceiling on one burn. Enforced here even if the host commands longer.
static const unsigned long MAX_BURN_MS        = 2000UL;

static const unsigned long STATUS_INTERVAL_MS = 100UL;  // 10 Hz telemetry
static const unsigned long SERVO_UPDATE_MS    = 20UL;   // 50 Hz slew update

// Max degrees per servo update -> ~250 deg/s. Limits inrush current and stops
// the large-step commands that stall an SG90 and brown out a shared rail.
static const float SLEW_RATE_DEG = 5.0f;
// Below the SG90 deadband, writing only produces buzz and current draw.
static const float DEADBAND_DEG  = 0.5f;

static const size_t RX_BUFFER_SIZE = 64;

// --------------------------------------------------------------- state ----
Servo servoPan;
Servo servoTilt;

