Roh00t/SDTH-Killswitch-Demo/firmware/esp32_actuator/wifi_secrets.example.h
static float targetPan   = STOW_PAN;
static float targetTilt  = STOW_TILT;
static float currentPan  = STOW_PAN;
static float currentTilt = STOW_TILT;

static bool armed        = false;
static bool effectorOn   = false;
// ESP32Servo::attach() returns the LEDC channel, or 0 on failure. Unchecked,
// a failed attach produces firmware that answers every command correctly and
// never emits a PWM pulse — silent servos with no error anywhere.
static int  panChannel   = 0;
static int  tiltChannel  = 0;
static bool estopLatched = true;   // Boot latched. An explicit arm is required.
static bool deadmanFired = false;

static unsigned long lastCommandMs = 0;
static unsigned long burnStartMs   = 0;
static unsigned long lastStatusMs  = 0;
static unsigned long lastServoMs   = 0;

static char   rxBuffer[RX_BUFFER_SIZE];
static size_t rxLength = 0;

// ------------------------------------------------------------- effector ----

/* De-energise unconditionally. Safe to call from anywhere, any number of times.
 * Writes the pin before touching any flag: if a later line faults, the hardware
 * is already safe. */
static void killEffector() {
  digitalWrite(PIN_EFFECTOR, LOW);
  effectorOn  = false;
  burnStartMs = 0;
}

/* Kill the effector AND drop arming. Used for faults and e-stop. */
static void safeState() {
  killEffector();
  armed = false;
}

static void emitError(const char* code, const char* detail) {
  Serial.print("ERR ");
  Serial.print(code);
  Serial.print(' ');
  Serial.println(detail);
}

// ------------------------------------------------------------- checksum ----

/* XOR of the body bytes, matching helper/hardware/protocol.py::checksum. */
static uint8_t computeChecksum(const char* body, size_t length) {
  uint8_t acc = 0;
  for (size_t i = 0; i < length; i++) acc ^= (uint8_t)body[i];
  return acc;
}

/* Split "BODY*XX" and verify.
 *
 * Asymmetric by design: only hazard-INCREASING commands (M1 arm, L1 fire) are
 * checksummed. Hazard-DECREASING commands (M0, L0, Z) are always accepted, so a
 * corrupted byte can never block a shutdown. Combined with two-key arming, it
 * takes two independently valid checksummed commands to energise the effector.
 */
static bool verifyChecksum(char* line, size_t length, size_t* bodyLength) {
  char* star = nullptr;
  for (size_t i = 0; i < length; i++) {
    if (line[i] == '*') { star = &line[i]; break; }
  }
  if (star == nullptr) return false;

  *bodyLength = (size_t)(star - line);
  if (length - *bodyLength - 1 < 2) return false;

  char hex[3] = { star[1], star[2], '\0' };
  uint8_t supplied = (uint8_t)strtoul(hex, nullptr, 16);
  return supplied == computeChecksum(line, *bodyLength);
}

// -------------------------------------------------------------- parsing ----

static float clampf(float value, float lo, float hi) {
  if (value < lo) return lo;
  if (value > hi) return hi;
  return value;
}

/* Parse "A<pan>,<tilt>". Returns false on any malformation. */
static bool parseAngles(const char* body, size_t length, float* pan, float* tilt) {
  char work[RX_BUFFER_SIZE];
  if (length >= RX_BUFFER_SIZE) return false;
  memcpy(work, body, length);
  work[length] = '\0';

  char* comma = strchr(work + 1, ',');
  if (comma == nullptr) return false;
  *comma = '\0';

  char* endPan  = nullptr;
  char* endTilt = nullptr;
  float p = strtod(work + 1, &endPan);
  float t = strtod(comma + 1, &endTilt);

  if (endPan == work + 1 || endTilt == comma + 1) return false;
  if (isnan(p) || isnan(t) || isinf(p) || isinf(t)) return false;

  *pan  = p;
  *tilt = t;
  return true;
}

static void handleCommand(char* line, size_t length) {
  if (length == 0) return;

  const char verb = line[0];

  // Z (e-stop) is processed ahead of everything, including its own validation.
  if (verb == 'Z') {
    safeState();
    estopLatched = true;
    lastCommandMs = millis();
    Serial.println("OK Z");
    return;
  }

  size_t bodyLength = length;
  bool checksummed  = verifyChecksum(line, length, &bodyLength);

  switch (verb) {
    case 'P':  // ping — refreshes the deadman and nothing else
      lastCommandMs = millis();
      deadmanFired = false;
      Serial.println("OK P");
      return;

    case 'S':
      lastCommandMs = millis();
      lastStatusMs = 0;  // force a status frame on the next loop
      return;

    case 'D': {  // diagnostics — is PWM actually being generated?
      lastCommandMs = millis();
      Serial.print("DIAG pan_pin="); Serial.print(PIN_SERVO_PAN);
      Serial.print(" pan_ch=");      Serial.print(panChannel);
      Serial.print(" pan_attached="); Serial.print(servoPan.attached() ? 1 : 0);
      Serial.print(" tilt_pin=");    Serial.print(PIN_SERVO_TILT);
      Serial.print(" tilt_ch=");     Serial.print(tiltChannel);
      Serial.print(" tilt_attached=");Serial.print(servoTilt.attached() ? 1 : 0);
      Serial.print(" us_range=");    Serial.print(SERVO_MIN_US);
      Serial.print("-");             Serial.println(SERVO_MAX_US);
      return;
    }

    case 'T': {  // raw sweep, bypassing slew limiting and the deadband
      lastCommandMs = millis();
      Serial.println("OK T raw sweep starting");
      for (int angle = 20; angle <= 160; angle += 10) {
        servoPan.write(angle);
        servoTilt.write(constrain(angle, (int)TILT_MIN, (int)TILT_MAX));
        delay(120);
      }
      servoPan.write((int)STOW_PAN);
      servoTilt.write((int)STOW_TILT);
      currentPan = targetPan = STOW_PAN;
      currentTilt = targetTilt = STOW_TILT;
      lastCommandMs = millis();
      Serial.println("OK T raw sweep done");
      return;
    }

    case 'A': {
      float pan, tilt;
      if (!parseAngles(line, bodyLength, &pan, &tilt)) {
        emitError("E02", "angle parse failed");
        return;
      }
      // Clamp, never wrap: 190 becomes 180, never 10.
      targetPan  = clampf(pan,  PAN_MIN,  PAN_MAX);
      targetTilt = clampf(tilt, TILT_MIN, TILT_MAX);
      lastCommandMs = millis();
      deadmanFired = false;
      Serial.println("OK A");
      return;
    }

    case 'M': {
      if (bodyLength < 2) { emitError("E02", "M needs 0 or 1"); return; }
      const bool wantArmed = (line[1] == '1');

      if (!wantArmed) {  // disarm is always honoured
        safeState();
        lastCommandMs = millis();
        Serial.println("OK M0");
        return;
      }
      if (!checksummed) { emitError("E05", "M1 requires checksum"); return; }

      estopLatched = false;  // an explicit checksummed arm clears the latch
      armed = true;
      lastCommandMs = millis();
      deadmanFired = false;
      Serial.println("OK M1");
      return;
    }

    case 'L': {
      if (bodyLength < 2) { emitError("E02", "L needs 0 or 1"); return; }
      const bool wantOn = (line[1] == '1');

