Roh00t/SDTH-Killswitch-Demo/firmware/esp32_actuator/wifi_secrets.example.h
      if (!wantOn) {  // de-energise is always honoured
        killEffector();
        lastCommandMs = millis();
        Serial.println("OK L0");
        return;
      }
      if (!checksummed)  { emitError("E05", "L1 requires checksum");      return; }
      if (estopLatched)  { emitError("E08", "e-stop latched");            return; }
      if (!armed)        { emitError("E04", "not armed; send M1 first");  return; }

      // Two independently valid checksummed commands were required to reach
      // this line: M1 to arm, then L1 to fire.
      digitalWrite(PIN_EFFECTOR, HIGH);
      effectorOn  = true;
      burnStartMs = millis();
      lastCommandMs = burnStartMs;
      deadmanFired = false;
      Serial.println("OK L1");
      return;
    }

    default:
      emitError("E01", "unknown verb");
      return;
  }
}

// --------------------------------------------------------------- safety ----

/* Host silence for longer than the window means the host is gone: crashed,
 * unplugged, blocked on the GIL, or stalled in GC. Cut the effector without
 * the host participating. */
static void checkDeadman() {
  if (millis() - lastCommandMs <= DEADMAN_TIMEOUT_MS) return;
  if (effectorOn || armed) {
    safeState();
    if (!deadmanFired) {
      emitError("E07", "deadman timeout: effector cut, disarmed");
      deadmanFired = true;
    }
  }
}

/* Independent burn ceiling. The host is not trusted to time its own burn. */
static void checkBurnCeiling() {
  if (!effectorOn || burnStartMs == 0) return;
  if (millis() - burnStartMs >= MAX_BURN_MS) {
    killEffector();
    emitError("E06", "burn ceiling reached: effector cut by firmware");
  }
}

// --------------------------------------------------------------- motion ----

/* Step current angles toward target at a bounded rate.
 *
 * SG90s have no position feedback, so "current" is the commanded angle and
 * nothing more. Rate limiting keeps inrush current down and avoids the large
 * steps that stall the servo. Never present these values as measured telemetry.
 */
static void updateServos() {
  const unsigned long now = millis();
  if (now - lastServoMs < SERVO_UPDATE_MS) return;
  lastServoMs = now;

  const float dPan  = targetPan  - currentPan;
  const float dTilt = targetTilt - currentTilt;

  if (fabsf(dPan) > DEADBAND_DEG) {
    currentPan += clampf(dPan, -SLEW_RATE_DEG, SLEW_RATE_DEG);
    servoPan.write((int)roundf(clampf(currentPan, PAN_MIN, PAN_MAX)));
  }
  if (fabsf(dTilt) > DEADBAND_DEG) {
    currentTilt += clampf(dTilt, -SLEW_RATE_DEG, SLEW_RATE_DEG);
    servoTilt.write((int)roundf(clampf(currentTilt, TILT_MIN, TILT_MAX)));
  }
}

static void sendStatus() {
  const unsigned long now = millis();
  if (now - lastStatusMs < STATUS_INTERVAL_MS) return;
  lastStatusMs = now;

  Serial.print("ST ");
  Serial.print(currentPan, 1);   Serial.print(',');
  Serial.print(currentTilt, 1);  Serial.print(',');
  Serial.print(effectorOn ? '1' : '0'); Serial.print(',');
  Serial.print(armed ? '1' : '0');      Serial.print(',');
  Serial.println(now);
}

static void pumpSerial() {
  while (Serial.available() > 0) {
    const char c = (char)Serial.read();

    if (c == '\n' || c == '\r') {
      if (rxLength > 0) {
        rxBuffer[rxLength] = '\0';
        handleCommand(rxBuffer, rxLength);
        rxLength = 0;
      }
      continue;
    }
    if (rxLength < RX_BUFFER_SIZE - 1) {
      rxBuffer[rxLength++] = c;
    } else {
      // Overlong line: discard and resynchronise on the next newline rather
      // than acting on a truncated command.
      rxLength = 0;
      emitError("E02", "rx overflow, line discarded");
    }
  }
}

// --------------------------------------------------------------- camera ----
#if KS_CAMERA
// Written by the camera task (core 0), read by loop() (core 1). Only loop()
// prints, so camera lines can never interleave with an ST frame on the UART.
static volatile int  cameraState = 0;    // 0 starting, 1 streaming, -1 init failed
static volatile int  cameraError = 0;
static volatile int  cameraPid   = 0;    // sensor product id: 0x5640 on an OV5640
static httpd_handle_t streamServer = nullptr;

// Wi-Fi diagnostics, same rule: core 0 writes, loop() prints. Without them a
// hotspot that refuses the board looks exactly like a URL that scrolled past.
static constexpr int SCAN_PENDING = -100;
static std::atomic<int> wifiScanCount{SCAN_PENDING};  // published last
static volatile int  wifiSeenRssi    = 0;    // 0: our SSID was not in the scan
static volatile int  wifiSeenChannel = 0;
static char          wifiNearby[4][33] = {}; // a few SSIDs the scan did hear
static volatile int  wifiDropReason  = 0;    // last STA_DISCONNECTED reason

#define STREAM_BOUNDARY "killswitchframe"

/* One MJPEG client at a time: the handler owns the server task while it
 * streams. Runs on the HTTP server task, pinned to core 0. */
static esp_err_t streamHandler(httpd_req_t* req) {
  httpd_resp_set_type(req, "multipart/x-mixed-replace;boundary=" STREAM_BOUNDARY);
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  char part[96];
  while (true) {
    camera_fb_t* fb = esp_camera_fb_get();
    if (fb == nullptr) {
      vTaskDelay(pdMS_TO_TICKS(10));
      continue;
    }
    const int headerLength = snprintf(
        part, sizeof(part),
        "\r\n--" STREAM_BOUNDARY "\r\nContent-Type: image/jpeg\r\nContent-Length: %u\r\n\r\n",
        (unsigned)fb->len);
    esp_err_t res = httpd_resp_send_chunk(req, part, headerLength);
    if (res == ESP_OK) res = httpd_resp_send_chunk(req, (const char*)fb->buf, fb->len);
    esp_camera_fb_return(fb);
    if (res != ESP_OK) return res;   // client went away
  }
}

static esp_err_t startCamera() {
  camera_config_t c = {};
  // The servos own LEDC timers 0 and 1 (allocateTimer in setup). XCLK takes
  // timer 3 and the last channel so it can never retime a servo.
  c.ledc_timer   = LEDC_TIMER_3;
  c.ledc_channel = LEDC_CHANNEL_7;
  c.pin_d0 = CAM_PIN_D0;  c.pin_d1 = CAM_PIN_D1;  c.pin_d2 = CAM_PIN_D2;
  c.pin_d3 = CAM_PIN_D3;  c.pin_d4 = CAM_PIN_D4;  c.pin_d5 = CAM_PIN_D5;
  c.pin_d6 = CAM_PIN_D6;  c.pin_d7 = CAM_PIN_D7;
  c.pin_xclk = CAM_PIN_XCLK;  c.pin_pclk = CAM_PIN_PCLK;
  c.pin_vsync = CAM_PIN_VSYNC;  c.pin_href = CAM_PIN_HREF;
  c.pin_sccb_sda = CAM_PIN_SIOD;  c.pin_sccb_scl = CAM_PIN_SIOC;
  c.pin_pwdn = -1;  c.pin_reset = -1;
  c.xclk_freq_hz = 20000000;
  c.pixel_format = PIXFORMAT_JPEG;
  c.grab_mode = CAMERA_GRAB_LATEST;   // never hand out a stale frame
  if (psramFound()) {
    c.frame_size = FRAMESIZE_VGA;  c.jpeg_quality = 12;
    c.fb_count = 2;                c.fb_location = CAMERA_FB_IN_PSRAM;
  } else {
    c.frame_size = FRAMESIZE_QVGA; c.jpeg_quality = 12;
    c.fb_count = 1;                c.fb_location = CAMERA_FB_IN_DRAM;
  }
  return esp_camera_init(&c);
}

static void startStreamServer() {
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.server_port = 80;
  config.core_id = 0;               // keep the stream off the safety core
  config.lru_purge_enable = true;   // a dead client frees its slot
  httpd_uri_t stream = {};
  stream.uri = "/stream";
  stream.method = HTTP_GET;
  stream.handler = streamHandler;
  if (httpd_start(&streamServer, &config) == ESP_OK) {
    httpd_register_uri_handler(streamServer, &stream);
  }
}

